
_ACCENT = '\u0301'

macros = {
    "C":"[бкдфгхлмнпрствжзнйш]",
    "V":"[аиоуэ]",
    "I":"[яиёюе]",
    "J":"[яёюе]",
    "'": _ACCENT,
    "_":"",
    "#":" "
}

rules = '''
    
    ɟ->gʲ  ç->xʲ  ɲ->ŋʲ  c->kʲ
    [aæʌɑə]->а [iɪ]->и [oɔɒ]->о [uʊw]->у [eɛɜ]->э
    [ɚɝ]->эр
    ʤ->дж
    tʃ->ч
    ŋg->нг
    ŋk->нк
    ŋ->нг
    b->б k->к d->д f->ф [gɡɣ]->г [hx]->х [ɫl]->л m->м n->н 
    p->п [rɹ]->р s->с t->т v->в ʒ->ж z->з j->й ʃ->ш 
    θ->ф ð->д
    ʲа->я  ʲи->и  ʲо->ё  ʲу->ю  ʲэ->е
    ʲ->ь

    ˈ->'
    ˌ->_
    'CCCV->CCCV:
    'CCV->CCV:
    'CV->CV:
    'V->V:
    у:V->уV:
    :->_
    ː->'

    Cй[аоуэ]->Cъй[аоуэ] 
    й[аоуэ] -> [яёюе]
    
'''